; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_5)

(:domain logistics)

(:objects
	obj0 obj3 - airport
	obj1 obj4 - city
	obj2 obj5 - truck
	obj6 obj7 obj9 obj11 obj15 obj16 - package
	obj8 obj10 obj13 - location
	obj12 obj14 - airplane
)

(:init
	(at obj2 obj0)
	(at obj5 obj3)
	(at obj6 obj0)
	(at obj7 obj3)
	(at obj9 obj3)
	(at obj11 obj3)
	(at obj12 obj0)
	(at obj14 obj3)
	(at obj15 obj3)
	(at obj16 obj0)
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(in-city obj8 obj1)
	(in-city obj10 obj4)
	(in-city obj13 obj4)
)

(:goal (and
	(at obj6 obj10)
	(at obj7 obj8)
	(at obj9 obj8)
	(at obj11 obj8)
	(at obj15 obj8)
	(at obj16 obj13)
))
)

; plan
1. (drive obj2 obj0 obj8)
   deleted: (at obj2 obj0)
   added: (at obj2 obj8)
   goals met: 0 of 6
2. (drive obj5 obj3 obj10)
   deleted: (at obj5 obj3)
   added: (at obj5 obj10)
   goals met: 0 of 6
3. (load obj12 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj12)
   goals met: 0 of 6
4. (load obj12 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj12)
   goals met: 0 of 6
5. (fly obj12 obj0 obj3)
   deleted: (at obj12 obj0)
   added: (at obj12 obj3)
   goals met: 0 of 6
6. (drive obj2 obj8 obj0)
   deleted: (at obj2 obj8)
   added: (at obj2 obj0)
   goals met: 0 of 6
7. (drive obj5 obj10 obj3)
   deleted: (at obj5 obj10)
   added: (at obj5 obj3)
   goals met: 0 of 6
8. (fly obj14 obj3 obj0)
   deleted: (at obj14 obj3)
   added: (at obj14 obj0)
   goals met: 0 of 6
9. (load obj12 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj12)
   goals met: 0 of 6
10. (load obj12 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj12)
   goals met: 0 of 6
11. (load obj12 obj7 obj3)
   deleted: (at obj7 obj3)
   added: (in obj7 obj12)
   goals met: 0 of 6
12. (load obj12 obj9 obj3)
   deleted: (at obj9 obj3)
   added: (in obj9 obj12)
   goals met: 0 of 6
13. (unload obj12 obj16 obj3)
   deleted: (in obj16 obj12)
   added: (at obj16 obj3)
   goals met: 0 of 6
14. (unload obj12 obj6 obj3)
   deleted: (in obj6 obj12)
   added: (at obj6 obj3)
   goals met: 0 of 6
15. (fly obj12 obj3 obj0)
   deleted: (at obj12 obj3)
   added: (at obj12 obj0)
   goals met: 0 of 6
16. (load obj5 obj16 obj3)
   deleted: (at obj16 obj3)
   added: (in obj16 obj5)
   goals met: 0 of 6
17. (load obj5 obj6 obj3)
   deleted: (at obj6 obj3)
   added: (in obj6 obj5)
   goals met: 0 of 6
18. (unload obj12 obj11 obj0)
   deleted: (in obj11 obj12)
   added: (at obj11 obj0)
   goals met: 0 of 6
19. (unload obj12 obj15 obj0)
   deleted: (in obj15 obj12)
   added: (at obj15 obj0)
   goals met: 0 of 6
20. (unload obj12 obj7 obj0)
   deleted: (in obj7 obj12)
   added: (at obj7 obj0)
   goals met: 0 of 6
21. (unload obj12 obj9 obj0)
   deleted: (in obj9 obj12)
   added: (at obj9 obj0)
   goals met: 0 of 6
22. (drive obj5 obj3 obj10)
   deleted: (at obj5 obj3)
   added: (at obj5 obj10)
   goals met: 0 of 6
23. (fly obj12 obj0 obj3)
   deleted: (at obj12 obj0)
   added: (at obj12 obj3)
   goals met: 0 of 6
24. (fly obj14 obj0 obj3)
   deleted: (at obj14 obj0)
   added: (at obj14 obj3)
   goals met: 0 of 6
25. (load obj2 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj2)
   goals met: 0 of 6
26. (load obj2 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj2)
   goals met: 0 of 6
27. (load obj2 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj2)
   goals met: 0 of 6
28. (load obj2 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj2)
   goals met: 0 of 6
29. (unload obj5 obj6 obj10)
   deleted: (in obj6 obj5)
   added: (at obj6 obj10)
   goals met: 1 of 6
30. (drive obj2 obj0 obj8)
   deleted: (at obj2 obj0)
   added: (at obj2 obj8)
   goals met: 1 of 6
31. (drive obj5 obj10 obj13)
   deleted: (at obj5 obj10)
   added: (at obj5 obj13)
   goals met: 1 of 6
32. (fly obj12 obj3 obj0)
   deleted: (at obj12 obj3)
   added: (at obj12 obj0)
   goals met: 1 of 6
33. (unload obj2 obj11 obj8)
   deleted: (in obj11 obj2)
   added: (at obj11 obj8)
   goals met: 2 of 6
34. (unload obj2 obj15 obj8)
   deleted: (in obj15 obj2)
   added: (at obj15 obj8)
   goals met: 3 of 6
35. (unload obj2 obj7 obj8)
   deleted: (in obj7 obj2)
   added: (at obj7 obj8)
   goals met: 4 of 6
36. (unload obj2 obj9 obj8)
   deleted: (in obj9 obj2)
   added: (at obj9 obj8)
   goals met: 5 of 6
37. (unload obj5 obj16 obj13)
   deleted: (in obj16 obj5)
   added: (at obj16 obj13)
   goals met: 6 of 6
